{"54":{"title":"How I use github.com to learn to code","description":"Students want to build things? Learning to code is one way that we can learn to build things\r\nwith minimal cost (a computer with Internet connection). It brings out the creativity inside us. \r\nCoding may sound intimidate to non-tech population but it is not entirely true. Github.com is \r\nthe one place we can get started, to learn to code, to learn to build things, to learn to share, \r\nand to meet great people anywhere on Earth.","slide_url":"","duration":30,"speaker_name":"Dao Ngoc Khanh","speaker_description":"I work at Axon Active Vietnam where we use agile development methodology to build things fast that work and make our users happy.","speaker_url":"","created_at":"2014-03-12 02:34:32.704545","updated_at":"2014-03-12 02:34:32","vote_count":5,"fav_count":0,"voted":false,"faved":false},"53":{"title":"Single Sign On (SSO): How does your company apply?","description":"SSO is not a new concept, even we’ve heard very much in your work or research. It's useful but it’s really belong to administration\/management people?\r\nIt's interesting for users but it's really complex and headache for someone implement it?\r\nEspecially nowadays, we are in an age of Troika Computing: Cloud, Social Network, Mobile, Big data and federation problems.\r\nSo, with being a professional organisation, or being a skilled member in development team, you will start from where? what is your knowledge about it? which methods will you choose to implement in your organisation? how to develop or intergrate to your customers' products? how does your organisation deploy to support customers and partners...","slide_url":"","duration":30,"speaker_name":"Do Duy Trung","speaker_description":"Freelancer","speaker_url":"","created_at":"2014-03-11 17:50:47.539944","updated_at":"2014-03-11 17:50:47","vote_count":1,"fav_count":0,"voted":false,"faved":false},"52":{"title":"Make responsive design more responsive","description":"Responsive design is now getting more popular with many websites have been used it to adapt multiple screens. By applying usable technique to overcome challenges that your responsive designs may meet, it will make your website to be more responsive. Also, in terms of using capability of browsers to create powerful responsive website, this will introduce the current and future supports to help us do it quickly and effectively.","slide_url":"","duration":30,"speaker_name":"Pham Minh Chanh","speaker_description":"I've started my career as web developer and experienced in leading front end projects for over 4 years. From precious experiences in working with many foreign digital magazines, I've got familiar with many kind of content presentation on web as well as technique used to do it. As improvement of smart devices and support of browser's vendors, I truly believe that the web layout will be more flexible in both developing and using.","speaker_url":"http:\/\/www.linkedin.com\/profile\/view?id=81425752","created_at":"2014-03-11 07:06:38.859168","updated_at":"2014-03-11 07:06:38","vote_count":14,"fav_count":0,"voted":false,"faved":false},"51":{"title":"How BPM can simplify developing enterprise applications","description":"Today, more and more enterprise organizations need us to build software system to handle their daily business. Not only we have to deal with the complexity of their business processes but also to deal with technical details of integrating other parts of the system together. Not to mention the potential of misunderstanding between to business point of view and the developers' due to differences in perspective. \r\n\r\nLife is too short to worry about too many things. That's why in this talk, we will introduce to you how to simplify things by using a BPM Suite.\r\n\r\nA BPM Suite is a framework that supports BPM (Business Process Management). Its concept is simple, it handles all the integration parts and help you to focus on the most important thing, the business processes. BPM Suite enables you to handle the complexity of customers' problem by a straight-forward, business-process oriented approach. You and the customers now can communicate under one perspective, the business processes. Therefore, it reduces the misunderstanding between business people and developers and helps us deliver good products. Find more details in the presentation.","slide_url":"","duration":45,"speaker_name":"Tran Phuc Hau","speaker_description":"I work as a software developer at Axon Active Vietnam. It is here that I've introduced and worked with BPM concepts and a real BPM Suite to deliver solutions to enterprise organizations. However, I still consider myself as an (Pragmatic) Apprentice.","speaker_url":"http:\/\/www.linkedin.com\/profile\/view?id=183168941","created_at":"2014-03-11 06:52:49.763327","updated_at":"2014-03-11 06:52:49","vote_count":8,"fav_count":0,"voted":false,"faved":false},"50":{"title":"How to be successful with Agile methodology","description":"Do you have to work overtime or frequently miss the deadlines? Is your team working with multiple projects and you all are overloading? Are you newbie to Agile? Or is your Agile team struggling with processes? Or you don't know what to improve for your Agile team? If you say yes to any of the above question, this section will definitely be for you. I will introduce you Agile - Scrum methodology. How is it applied successfully at Axon Active Vietnam? Some tips to start up and improve your Agile team. Last but not least, I will introduce 2 tools for Scrum: MyAgile and Scrool.","slide_url":"","duration":45,"speaker_name":"Le Hai Tra","speaker_description":"I'm a Scrum Master of Dilbert team at Axon Active Vietnam. I moved from a water fall team leader under CMMi level 5 certification into a Scrum team working for 3 projects. My responsibilities are not only to deliver new features to these projects on time but also to maintain and support for production issues.","speaker_url":"http:\/\/www.linkedin.com\/profile\/view?id=258116832","created_at":"2014-03-11 03:35:39.301295","updated_at":"2014-03-11 03:35:39","vote_count":16,"fav_count":0,"voted":false,"faved":false},"49":{"title":"How to utilize technology to get smarter, stronger and more successful?","description":"\r\nEver want to improve your memory? to learn a new language? to train for a marathon? or learn new skill?\r\nIn our new era, the ability gaining new skills and sharping your ability is crucial to become successful.\r\n\r\nIn this talk, we will discuss about the latest technology, what psychologists and software engineers are working on to help you learn faster and successfully achieve new habits?","slide_url":"","duration":45,"speaker_name":"Võ Thành Công","speaker_description":"I'm passionate about education and self-improvement.\r\nI build 30 Day Challenge app to motivate people achieve new habits.\r\nI'm also working on a startup that builds Apo app to help people to learn vocabulary with friends.","speaker_url":"http:\/\/kong.vn","created_at":"2014-03-11 03:16:53.4714","updated_at":"2014-03-11 03:16:53","vote_count":13,"fav_count":0,"voted":false,"faved":false},"47":{"title":"How Chrome Apps will take over the world","description":"Content:\r\nWhat is Chrome Apps?\r\nWhere can they run?\r\nWhy will they take over other kinds of app (web, desktop, mobile)?\r\nHow to build one?\r\nWhen should you start building it?\r\n\r\nJoin this talk to discuss more.","slide_url":"","duration":30,"speaker_name":"Anh-Dao Le","speaker_description":"Web Passionate Software Engineer - TicketBox.vn","speaker_url":"http:\/\/anhdao.it","created_at":"2014-03-10 16:51:22.558963","updated_at":"2014-03-10 16:51:22","vote_count":28,"fav_count":0,"voted":false,"faved":false},"46":{"title":"Online English learning: trends and potentials for innovation with Natural Lanugage Processing ","description":"Online education is getting hotter day by day with the advent of MOOC such as Coursera. \r\n\r\nJoining this wave of moving to online learning, we have seen a lot of online services dedicated to learning English online, in the world and in Vietnam. \r\n\r\nIn this talk, I'd like to share with the audience about how we see online language learning will evolve in the years to come. \r\n\r\nI'd also share with the audience how applications of Natural Language Processing will hold the key to this innovation and some of the starting steps that we at LeeRit have done in this direction (with Python!)\r\n\r\n","slide_url":"","duration":45,"speaker_name":"Hưng","speaker_description":"Hưng Hoàng is friendly guy, and is the co-founder of LeeRit.com, an online vocabulary learning website featuring Smart Multiple Choice Program, one of the most advanced vocabulary learning programs in the world. \r\n\r\nAs a language lover, he has worked on multiple language-processing projects in different languages (e.g., Thai, Japanese and French) for various companies, including startups. With his burning passion and more than 15 years of experience in learning English and other languages, he has attained a unique understanding of the structures of languages as well as the language learning process.\r\n\r\nHưng obtained his bachelor degree from from School of Computing, National University of Singapore. \r\n","speaker_url":"http:\/\/blog.leerit.com\/join-leerit\/","created_at":"2014-03-10 07:46:59.189769","updated_at":"2014-03-10 07:46:59","vote_count":7,"fav_count":0,"voted":false,"faved":false},"45":{"title":"QUẢNG CÁO TRÊN MOBILE","description":"Bàn sắp, sẽ và đang làm một phần mềm hoặc game moblie và muốn bán quảng cáo trên đó ? \r\nQuảng  cáo như thế nào thì nhiều tiền ?\r\nHiện giờ thì có những loại hình quảng cáo nào ?\r\nNgười mua quảng cáo hay hệ thống thích loại quảng cáo nào ?\r\nLàm thế nào để quảng cáo của bạn hài hòa và không phản cảm ?","slide_url":"","duration":30,"speaker_name":"Trần Thiện Học","speaker_description":"Bussiness Development tại VCCorp","speaker_url":"http:\/\/www.tatino.vn","created_at":"2014-03-07 17:00:23.029766","updated_at":"2014-03-07 17:00:23","vote_count":27,"fav_count":0,"voted":false,"faved":false},"43":{"title":"Creating a WebSocket-Chat-Application with Jetty Embedded","description":"This talk is about techniques for building a multi-platform chat system. This system consists of a few features such as: chat on more than 2 devices at the same time, notification, online friends, etc ... We will also discuss about the performance of this system. Join with me.","slide_url":"","duration":45,"speaker_name":"Nguyễn Võ Cao Minh","speaker_description":"Tech Lead at CENT Technology","speaker_url":"http:\/\/minh3d.me","created_at":"2014-03-06 12:04:05.04662","updated_at":"2014-03-06 12:04:05","vote_count":59,"fav_count":0,"voted":false,"faved":false},"42":{"title":"How to build Recommender System","description":"If your system need some recommendation or\/and suggestion. Join with me.","slide_url":"","duration":30,"speaker_name":"Võ Duy Tuấn","speaker_description":"Just another developer.","speaker_url":"http:\/\/www.slideshare.net\/lonelywolf","created_at":"2014-03-06 09:20:22.368274","updated_at":"2014-03-06 09:20:22","vote_count":53,"fav_count":0,"voted":false,"faved":false},"41":{"title":"Making money with Atlassian Connect Plugins","description":"This talk is about the recently released Atlassian Connect Plugin Framework which allows third party developers to build and sell extensions to Atlassian applications.\r\n1. Sample Node.js application: how easy to develop a simple extension point\r\n2. Deployment options: how to get the sample application deployed on Heroku\r\n3. Making money: how to sell the application on Atlassian Market place\r\n","slide_url":"","duration":45,"speaker_name":"Michael Ruflin","speaker_description":"I am a Team Leader at Atlassian working on JIRA Service Desk","speaker_url":"","created_at":"2014-03-06 03:15:20.751253","updated_at":"2014-03-06 03:15:20","vote_count":48,"fav_count":0,"voted":false,"faved":false},"40":{"title":"The Psychologist’s View of UX Design","description":" A visual designer approaches UX design from one point of view, the interaction designer from another, and the programmer from yet another... So what we know about people and how we apply that to UX design.","slide_url":"","duration":45,"speaker_name":"Tran Nam Viet","speaker_description":"Founder of iDesign.vn","speaker_url":"http:\/\/idesign.vn","created_at":"2014-03-05 09:41:39.898626","updated_at":"2014-03-05 09:41:39","vote_count":83,"fav_count":0,"voted":false,"faved":false},"39":{"title":"Importance of Keywords in Digital Age","description":"Every second, millions of searches are conducted around the world in all languages by Internet users searching for information on the world wide web.  Website owners and web designers need to know the importance of keywords in the Digitial Age.  How do you do keyword research and keyword selection?  Do you know how to insert keywords into your web pages so that search engines correctly identify what the web pages are about.  My presentation explains why and how to get to the first page fast and drive more traffic to your web pages.","slide_url":"https:\/\/drive.google.com\/file\/d\/0B5O3lDjGYblLekI0dHZRLVEtUDA\/edit?usp=sharing","duration":15,"speaker_name":"Chris Walker","speaker_description":"I am an American living in Vietnam since 2008.  I work as a web ranking consultant in Ho Chi Minh City.  My clients include Thai Son Garment Factory, Uncle Bill Stores and freelance consultants who need advice while developing their digital marketing strategy.","speaker_url":"http:\/\/www.web-ranking.vn\/E-Marketing-Expert-in-Ho-Chi-Minh-City.html","created_at":"2014-03-05 00:58:35.432954","updated_at":"2014-03-05 00:58:35","vote_count":31,"fav_count":0,"voted":false,"faved":false},"37":{"title":"Making quick interactive and responsive mock-ups for your product with Axure 7","description":"Since its launch, Axure 7 has become one of the most powerful tool to create mock-ups designs for softwares and web products. With great support for responsiveness, variable and dataset, you can make nearly everything you want in your product with Axure. \r\nThis presentation will be a quick demo of how your team can transform ideas into real interactions and ready for test, within hours (or even minutes).","slide_url":"","duration":30,"speaker_name":"Dung Dang","speaker_description":"Dung Dang is a UX\/Interactive designer at Evolution Software Ltd. Since the beta stage of Axure 7, he has been applying this product to renovate UX designing in his team. Because of this, his team has become one of the earliest to understand and to take full advantage of this powerful tool in design ","speaker_url":"http:\/\/www.dungdang.com","created_at":"2014-03-01 15:27:12.555288","updated_at":"2014-03-01 15:27:12","vote_count":13,"fav_count":0,"voted":false,"faved":false},"36":{"title":"Kĩ thuật thu thập dữ liệu từ Web để tạo nội dung cho ứng dụng địa điểm.","description":"Bạn đang cần một giải pháp để xây dựng nội dung ban đầu cho một ứng dụng mới? <br>\r\nHoặc đã từng có ý định làm một ứng dụng tổng hợp dữ liệu từ Web như : Báo Mới, Nhà Nhà, Nhà Trọ Tốt,...? <br>\r\nHoặc đang có một ý tưởng hay ho nào đó về ứng dụng địa điểm? <br>\r\n<br>\r\nNếu có, thì bài trình bày này sẽ phần nào hữu ích đối với bạn. <br>\r\n<br>\r\nBài trình bày sẽ giới thiệu về framwork Scrapy, sẽ nói về các vấn đề thường gặp và giải pháp khi xây dựng một chương trình tự động thu thập dữ liệu web, đặc biệt là dữ liệu đặc thù cho ứng dụng địa điểm.","slide_url":"","duration":30,"speaker_name":"Nguyễn Hồng Điệp","speaker_description":"A Search Engine Lover, MagikHub","speaker_url":"http:\/\/magik.vn","created_at":"2014-02-26 07:02:18.302051","updated_at":"2014-02-26 07:02:18","vote_count":101,"fav_count":0,"voted":false,"faved":false},"35":{"title":"The Internet of Things: let's \"make\" big data!","description":"The Internet of Things is not a myth and it will change our life as everything around us gets connected and generates (big) data. If you already have programming skills, extend your capacity for innovation from virtual bits to real atoms: become a maker and build the next killer smart device!\r\nIn this hands on session we will show you in practice how you can turn your house into a smart house with your mobile, arduino and IFTTT.\r\n* Arduino: a type of single-board microcontroller\r\n* IFTTT: If This Then That ","slide_url":"","duration":60,"speaker_name":"Phan Hoang-Anh Phan & Nguyen Trong Nhan","speaker_description":"We both work in two different IT outsourcing companies, but this session is about something else we have in common and that we do outside of work: an enthusiasm for tech-tinkering and \"making\" stuff.","speaker_url":"","created_at":"2014-02-25 15:43:29.039284","updated_at":"2014-02-25 15:43:29","vote_count":56,"fav_count":0,"voted":false,"faved":false},"34":{"title":"Developer Breakthrough Success – Code is not the key","description":"Other factors that help the Developers:\r\n- Empower your role as a developer\r\n- Advance in your developer career (or even your career as something else) \r\n- Be a happier developer\r\n","slide_url":"","duration":45,"speaker_name":"Nguyen The Vinh ","speaker_description":"Technical Director - Pyramid Consulting ","speaker_url":"","created_at":"2014-02-25 04:09:14.281624","updated_at":"2014-02-25 04:09:14","vote_count":42,"fav_count":0,"voted":false,"faved":false},"33":{"title":" Product continuous delivery for cloud","description":"How Atlassian brings all our products (JIRA, Confluence, Bamboo, Bitbucket, etc.) to cloud environment (Atlassian OnDemand) and continuously delivers new features to our customers and keep them happy. \r\n\r\nWe will discuss about toolsets, processes used and how they can affect our developers’ life.","slide_url":"","duration":45,"speaker_name":"Nguyen Tuong Huy ","speaker_description":"Technical Architect\/Dev Manager, Atlassian Vietnam","speaker_url":"","created_at":"2014-02-24 03:56:31.154078","updated_at":"2014-02-24 03:56:31","vote_count":43,"fav_count":0,"voted":false,"faved":false},"32":{"title":"Agile Cross Borders : getting over the langage barrier","description":"Nowadays, the working places growing in companies are completely different compared with what we knew before : and we can recognize that the main change is based on diversity\r\n\r\nCulture, level of experience, sectors, juniors and seniors, on site\/ remotely…. \r\nAnd the projects are involving more and more people from different countries\r\n\r\nAs the Agile manifesto set \"Individuals and interactions\" as a value, how could we imagine natural interactions with such a diversity in project teams, how the agile transition is possible?\r\n\r\nWorking in Ho Chi minh with vietnamese teams and french customer we realized that the language was one of the main barrier to an agile transition in a such diversified agile team.\r\n\r\nHopefully, this impediment became a challenge for us. After one year working on this agile transition, success and failures drive us to think that we covered some distance.\r\n\r\nThis session will give you the opportunity to identify among a team, by enjoying basic improv games, which kind of methods can be combined to get over the language barriers in a diversified team.","slide_url":"http:\/\/prezi.com\/wd9m3sasz19n\/agile-cross-borders\/","duration":60,"speaker_name":"Anaïs Victor","speaker_description":"Working abroad was a dream... and I realized it when I moved to Vietnam in 2012. I studied IT in France, but it was clearly not my true passion...\r\nAs all young girls I wanted to be a princess, a teacher, a baker. Finally, I gave up, business analyst will be definitely my position. \r\nThen I was introduced to agile and... I was not convinced at all. Happily the Agile Vietnam Tour 2012 changed my mind : with agile I learnt to work differently, and it worked\r\nWe improved our delivery, our solidarity, our relationships, our communication and... so much that it's maybe why my nickname is now \"con két\".","speaker_url":"http:\/\/vn.linkedin.com\/in\/anaisvictor\/","created_at":"2014-02-23 17:44:31.481565","updated_at":"2014-02-23 17:44:31","vote_count":30,"fav_count":0,"voted":false,"faved":false},"31":{"title":"Interactive Development with Vim","description":"Speed up your programming cycle: write - compile - run - loop with the old-school (but never out-cool) toolbox: Lisp language and Vim editor.\r\nThe topic is a walkthrough of best pratices and recipes collected in a fast feedback workflow that does not interrupt your train of thought.","slide_url":"","duration":30,"speaker_name":"Huy Le","speaker_description":"A minimalist, hipster programmer and Clojure enthusiast.","speaker_url":"http:\/\/www.huylenq.com","created_at":"2014-02-22 04:47:30.34535","updated_at":"2014-02-22 04:47:30","vote_count":35,"fav_count":0,"voted":false,"faved":false},"30":{"title":"SCRUM, TDD and pair programming: the practices applied at East Agile","description":"Working over-time, staying late or over-night in the office are very common among software developers. East Agile has a different opinion on this. By applying agile development methods, East Agile focuses on the individuals. We don't encourage working late or overtime. Our developers go home from office in decent times even though the release is the next day. Our customers are satisfied with what we do and our developers are happy with their working hours. Here in East Agile we combined many practices and techniques of agile software development method. How we actually develop without well-defined requirements; How we keep up while swapping developers around projects. This talk will give you an insight into what benefits agile development methods can deliver to both customers and developers. ","slide_url":"","duration":30,"speaker_name":"Nguyen Anh Tung","speaker_description":"Senior Project Director","speaker_url":"http:\/\/www.linkedin.com\/pub\/tung-nguyen-anh\/62\/8a8\/717","created_at":"2014-02-21 03:32:11.532953","updated_at":"2014-02-21 03:32:11","vote_count":81,"fav_count":0,"voted":false,"faved":false},"29":{"title":"AngularJS BEST Practices","description":"In recent years, we have heard a lot about Full Stack development. What does Full Stack really mean? What is AngularJS? How does it work in large application? What are the best practices in AngularJS? How's about AngularJS performance? In my speech, I will walk through all questions above and share my favorite stack which are AngularJS, NodeJS, Yeoman, BowerJS, GruntTask, SailsJS, Less. Check out my init slide below. I will improve it at the event. ","slide_url":"http:\/\/www.slideshare.net\/hungtaoquang\/angularjs-bestpractices","duration":45,"speaker_name":"Henry Tao","speaker_description":"Fullstack Developer at Data Analytic Startup - Coral.io","speaker_url":"http:\/\/www.linkedin.com\/in\/henrytao","created_at":"2014-02-18 14:13:12.501621","updated_at":"2014-02-18 14:13:12","vote_count":79,"fav_count":0,"voted":false,"faved":false},"27":{"title":"How did Puppet change our System Engineer's life?","description":"This topic have three main contents: \r\n\r\n\t+ The reason why we need a configuration management tool.\r\n\r\n\t+ Why do we choose Puppet?\r\n\r\n\t+ Some results we do with Puppet:\r\n\t\t- Puppet with linux os kernel setting. \r\n\t\t- Deploy Web cluster.\r\n\t\t- Deploy Hadoop cluster.","slide_url":"","duration":45,"speaker_name":"Phung Dac Hung","speaker_description":"System Engineer at VNG Corporation.","speaker_url":"","created_at":"2014-02-11 03:08:02.731484","updated_at":"2014-02-11 03:08:02","vote_count":127,"fav_count":0,"voted":false,"faved":false},"26":{"title":"PHP Phalcon - Another Approach To Develop Website","description":"1\/ What is Phalcon? \r\nPhalcon is a web framework implemented as a C extension offering high performance and lower resource consumption. This is fastest PHP framework.\r\n2\/ My modules for developing website via Phalcon\r\nPhalcon is fun but something hard to develop, I introduce my modules (another way) to develop website.\r\n3\/ Benchmark and summary\r\nBenchmark Pure Phalcon, Phalcon Extension Module and  other frameworks together","slide_url":"","duration":45,"speaker_name":"Trần Minh Quang","speaker_description":"Senior PHP Developer at Tiki.vn","speaker_url":"http:\/\/tmquang6805.blogspot.com","created_at":"2014-02-10 07:24:46.428355","updated_at":"2014-02-10 07:24:46","vote_count":123,"fav_count":0,"voted":false,"faved":false},"25":{"title":"Build Messaging \/ Voice \/ Video application with webrtc.org","description":"How to build Messaging \/ Voice \/ Video application using open source Webrtc. Cross-platform on browsers, iOS, Android & Desktop.","slide_url":"","duration":30,"speaker_name":"Loi Ngo","speaker_description":"Co-founder of www.htk-inc.com a software services agency that focuses to Real-Time technology and large-scale web apps.","speaker_url":"","created_at":"2014-02-09 13:59:41.299722","updated_at":"2014-02-09 13:59:41","vote_count":139,"fav_count":0,"voted":false,"faved":false},"24":{"title":"Salary Negotiation 2.0: How To Get a Higher Salary","description":"Chris Harvey, the Founder & CEO of ITviec.com, will share job and salary negotiation tips specifically for technology professionals. Attend and you'll learn:\r\n\r\n1) The biggest mistake most people make when taking a new job\r\n2) How to get more salary and have your boss thank you for it\r\n3) How to make the company hungry for your talent\r\n4) Exactly how to respond when the company says \"There's no more budget.\"\r\n5) And more...\r\n\r\nWant more salary? Vote for this workshop now!\r\n\r\n","slide_url":"","duration":30,"speaker_name":"Chris Harvey","speaker_description":"Chris Harvey is the Founder and CEO of ITviec.com, a job website focusing on skilled IT jobs in Vietnam. \r\n\r\nChris has been in the internet industry for 14 years. From 2006 to 2012 Chris was CEO of VietnamWorks.com. From 2000 to 2006 he worked at Yahoo! and AOL in Silicon Valley USA.","speaker_url":"http:\/\/blog.itviec.com\/about-us\/","created_at":"2014-02-09 11:26:27.018688","updated_at":"2014-02-09 11:26:27","vote_count":129,"fav_count":0,"voted":false,"faved":false},"22":{"title":"Build Your Own Heroku With the Docker Ecosystem","description":"We'll explore the ecosystem of Docker and how to leverage it to build your private Platform as a Service (PaaS). The ecosystem around Docker literally exploded over the past year and there are a few open source solutions worth considering when you're thinking about building a private PaaS. We'll have a look at the most popular solutions and compare them to identify the best fit for your scenario (Dokku, Flynn, Deis, Tsuru).\r\n\r\nI'll prepare two different live demo environments, where you can deploy your pet project during the talk and the entire TechCamp day.","slide_url":"","duration":45,"speaker_name":"Sebastian Korfmann","speaker_description":"R&D Software-Engineer at Bulletproof Networks in Australia","speaker_url":"http:\/\/twitter.com\/skorfmann","created_at":"2014-02-07 08:25:25.544052","updated_at":"2014-02-07 08:25:25","vote_count":44,"fav_count":0,"voted":false,"faved":false},"21":{"title":"Reactive Real-time Big Data with Open Source Lambda Architecture","description":"+ Apply Reactive Pattern for Real-time Data Processing\r\n+ Lambda Architecture in Real-time Big Data Project \r\n+ Concepts & Techniques “Thinking with Lambda” \r\n+ Case study in some real projects \r\n+ Why lambda architecture is correct solution for big data? ","slide_url":"http:\/\/www.slideshare.net\/tantrieuf31\/lambda-architecture-for-real-time-big-data","duration":45,"speaker_name":"Nguyễn Tấn Triều","speaker_description":"Principal Engineer at Backend Analytics System, FPT Online (eclick.vn)","speaker_url":"http:\/\/nguyentantrieu.info","created_at":"2014-02-07 03:41:02.727458","updated_at":"2014-02-07 03:41:02","vote_count":106,"fav_count":0,"voted":false,"faved":false},"19":{"title":"ReactJS - building large applications with data that changes over time","description":"This is new JS framework that focus on the V only in the MVC model. So with ReactJS it can help you manage the data change over the time. we just change the data it will manage how to update the view and more interesting things...\r\n\r\nI will have small talk to present the new technique and give you guys the new concept about this.","slide_url":"http:\/\/facebook.github.io\/react\/index.html","duration":45,"speaker_name":"Le Minh Duy","speaker_description":"Web Developer at Cogini Vietnam","speaker_url":"","created_at":"2014-02-07 02:30:15.680869","updated_at":"2014-02-07 02:30:15","vote_count":56,"fav_count":0,"voted":false,"faved":false},"18":{"title":"Async control with Go-style channels in Python\/Javascript","description":"Async programming with reactor pattern is on the rise, with Node.js, Twisted, Tornado (and the browsers!). Their callback-style programming is messy. Promises\/deferreds are an inadequate solution. We are going to explore how the concept of CSP channels, popularized by Go, can be applied to Javascript\/Python to write better async programs, both server-side and client-side.","slide_url":"https:\/\/ubolonton.org\/slides\/csp-in-js-py.html","duration":60,"speaker_name":"Nguyễn Tuấn Anh","speaker_description":"Tech Lead at Cogini Vietnam.\r\n\r\nInterested in no-nonsense stuff.\r\n","speaker_url":"http:\/\/www.linkedin.com\/in\/ubolonton","created_at":"2014-02-06 15:56:44.046865","updated_at":"2014-02-06 15:56:44","vote_count":48,"fav_count":0,"voted":false,"faved":false},"17":{"title":"Why you should use PostgreSQL","description":"PostgreSQL is a high-quality database that is comparatively little known (against e.g. MySQL). We are going to take a look at some of its awesome features to see why this gem should be used much more than it currently is.","slide_url":"https:\/\/ubolonton.org\/slides\/why-postgresql.html","duration":45,"speaker_name":"Nguyễn Tuấn Anh","speaker_description":"Tech Lead at Cogini Vietnam.\r\nInterested in no-nonsense stuff.\r\n","speaker_url":"http:\/\/www.linkedin.com\/in\/ubolonton","created_at":"2014-02-06 15:55:52.908934","updated_at":"2014-02-06 15:55:52","vote_count":66,"fav_count":0,"voted":false,"faved":false},"16":{"title":"Building Single-page Web Applications with AngularJS","description":"In recent days, web developers probably hear a new approach of building web application called “single-page web application” (or single-page application) somewhere in IT newspaper and magazines. This concept was discussed early in 2003 and in 2005 the term “single-page” was coined. Since then, the amount of website following single-page technique grows tremendously and it becomes another option for web developers when they look on technologies to build a web application. As result, several “single-page” frameworks were born to help web developers do their work easier. With mission of “HTML enhanced for web app”, AngularJS began its life with first 0.9 release in Oct 2010 and till now, it grows rapidly to become one of ideal frameworks for anyone who want to build the web in single-page way. This topic will give you  Single-page approach and how to apply it with AngularJS","slide_url":"","duration":45,"speaker_name":"Duy Lam","speaker_description":"Duy works as researcher at RD department in KMS Technology. Currently he's in love with web things (ASP.NET MVC, Ruby on Rails, AngularJS, Backbone.js, etc.) and javascript language","speaker_url":"http:\/\/vn.linkedin.com\/in\/duylamphuong","created_at":"2014-02-05 03:50:37.047945","updated_at":"2014-02-05 03:50:37","vote_count":113,"fav_count":0,"voted":false,"faved":false},"15":{"title":"Educational technology","description":"Educational technology, sometimes termed EdTech, is the study and ethical practice of facilitating e-learning, which is the learning and improving performance by creating, using and managing appropriate technological processes and resources.[ The term educational technology is often associated with, and encompasses, instructional theory and learning theory. While instructional technology is \"the theory and practice of design, development, utilization, management, and evaluation of processes and resources for learning,\" according to the Association for Educational Communications and Technology (AECT) Definitions and Terminology Committee,[2] educational technology includes other systems used in the process of developing human capability. Educational technology includes, but is not limited to, software, hardware, as well as Internet applications, such as wikis and blogs, and activities. But there is still debate on what these terms mean.","slide_url":"http:\/\/prezi.com\/paulch1gteqk\/tech-in-education-then-and-now\/","duration":60,"speaker_name":"henry nguyen ","speaker_description":"","speaker_url":"","created_at":"2014-01-31 15:21:49.12669","updated_at":"2014-01-31 15:21:49","vote_count":33,"fav_count":0,"voted":false,"faved":false},"14":{"title":"Xamarin - build cross-platform mobile applications with C#","description":"Have you ever thought that you can use C# to create NATIVE mobile applications for iOS and Android? Have you ever thought that your code could be shared in Windows Phone, Android and iOS applications? Have you ever thought that you can combine C# with Objective-C and Java library?\r\n\r\nIf these questions interest you, then let's give me a try. It's not an introduction which you can find in Internet by yourself, it's about my experiences in reality.  ","slide_url":"http:\/\/www.slideshare.net\/kmstechnology\/cross-platform-mobile-development-with-c-and-xamarin","duration":60,"speaker_name":"An Nguyen","speaker_description":"An Nguyen is a Senior Software Engineer at KMS Technology Inc. He is working as a researcher in R&D department and focusing on mobile development. ","speaker_url":"http:\/\/www.kms-technology.com\/","created_at":"2014-01-27 02:04:21.275141","updated_at":"2014-01-27 02:04:21","vote_count":85,"fav_count":0,"voted":false,"faved":false},"13":{"title":"Mobile cross-platform Corona SDK","description":"I will focus on inspiration over my tactics, real experiences struggling with the Corona SDK issues, genuinely.\r\nI hope that the audiences will like it and recognize Corona SDK as a good cross-platform engine for a few specific app types.","slide_url":"","duration":30,"speaker_name":"Khoi Nguyen","speaker_description":"Senior Software Engineer at KMS-technology","speaker_url":"","created_at":"2014-01-25 03:49:51.765738","updated_at":"2014-01-25 03:49:51","vote_count":94,"fav_count":0,"voted":false,"faved":false},"12":{"title":"Simple tricks to dramatically improve MySQL query's performance ","description":"MySQL is widely used in WEB development, mastering it could improve the speed of your website significantly","slide_url":"","duration":30,"speaker_name":"Hieu Vo","speaker_description":"PHP Developer at Lazada","speaker_url":"http:\/\/www.hvmark.com","created_at":"2014-01-24 03:59:56.393194","updated_at":"2014-01-24 03:59:56","vote_count":73,"fav_count":0,"voted":false,"faved":false},"11":{"title":"How a small team can make games with millions of worldwide download","description":"Introducing, story about the company. Experience, tips about how a small team can make games with millions of worldwide download.","slide_url":"http:\/\/senspark.com","duration":15,"speaker_name":"Lam Ho","speaker_description":"Lam is founder of Senspark, a mobile game company focus on iOS, Android and more.","speaker_url":"http:\/\/fb.com\/lam.ho.viet","created_at":"2014-01-21 20:08:33.981382","updated_at":"2014-01-21 20:08:33","vote_count":56,"fav_count":0,"voted":false,"faved":false},"10":{"title":"Introduction to continuous integration (How i learned to stop worrying and love the bugs)","description":"Story of how I learned about continuous integration and testing and love it. Includes a 5 minute demo of Jenkins CI.\r\n\r\nThe talk will answer the following questions:\r\n- Why CI is great for deliverying better software, faster\r\n- How to setup CI","slide_url":"http:\/\/www.slideshare.net\/hroussel\/introduction-to-continuous-integration-how-i-learned-to-stop-worrying-and-love-the-bugs-27837000","duration":30,"speaker_name":"Herve Roussel","speaker_description":"High Tech Entrepreneur & Software Engineer.\r\n\r\nHerve Roussel is the Co-Founder and former CTO of Linked Senior, a successful US Tech Startup based in Washington DC. Linked Senior has been featured on CNN Money & the Washington Post. Herve has 10 years of Tech experience in the US with Fortune 500 companies as well as Startups. He is an alumni of Silicon Valley's \"Plug N Play\" Startup Camp. He holds a Master of Engineering in Computer Science from Cornell University. Herve has been a guest lecturer for \"CS Senior Design\" at the George Washington University, an ambassador for Cornell University Alumni Network and a business plan judge for the William James Foundation. Since November 2013, he is the Committee Chair for the CAAAN (Cornell Alumni Admissions Ambassador Network) in Vietnam.","speaker_url":"http:\/\/www.herveroussel.com\/","created_at":"2014-01-21 09:11:23.557979","updated_at":"2014-01-21 09:11:23","vote_count":57,"fav_count":0,"voted":false,"faved":false},"9":{"title":"Startup Scenes Across Asia","description":"I will cover up to 10 different startup scenes in Asia and what kinds of startup ideas are coming out of them. The talk will go through what ideas are really interesting for Asia and what makes Asian startups different from Silicon Valley startups.","slide_url":"http:\/\/www.youtube.com\/watch?v=vV7qgpecSaY","duration":30,"speaker_name":"Anh-Minh Do","speaker_description":"Editor at Tech In Asia","speaker_url":"http:\/\/caligarn.com","created_at":"2014-01-18 11:20:29.1842","updated_at":"2014-01-18 11:20:29","vote_count":71,"fav_count":0,"voted":false,"faved":false},"8":{"title":"Taxi app development and POIs issues","description":"Challenges we have to deal with when building and running GrabTaxi app (leading e-hailing app in Southeast Asia): how to deal with GPS issues, POIs (point of interests) or address, how to connect drivers and passengers seamlessly.","slide_url":"http:\/\/www.grabtaxi.com","duration":15,"speaker_name":"Nguyen Tuan Anh","speaker_description":"General Manager, GrabTaxi Vietnam","speaker_url":"","created_at":"2014-01-17 02:33:42.407431","updated_at":"2014-01-17 02:33:42","vote_count":42,"fav_count":0,"voted":false,"faved":false},"7":{"title":"Software Estimation Techniques","description":"Estimation is considered the building block of many activities in software development life circle. These include schedule planning, budget planning and resources planning. Accuracy of estimate affects these activities and in general the project ability to hit target. Given that responsibility, developers' attitude towards estimation is still neglected. If I ask you how long would it take to finish your coming release, there is a huge change that I would get a single-point number answer, like 3 days. That isn't an estimate, that is your target. And the misunderstanding since the very first concept leads to all sort of mistake down the line.","slide_url":"http:\/\/khang.cogini.com\/SoftwareEstimationTraining\/","duration":60,"speaker_name":"Khang Nguyen","speaker_description":"Khang Nguyen is the Chief Representative of Cogini Vietnam, an R&D branch of Cogini. Here he is honing his skills in dynamic web technologies, mobile platforms and back-end enterprise applications.","speaker_url":"http:\/\/blog.khangnguyen.me\/","created_at":"2014-01-07 04:20:27.643604","updated_at":"2014-01-07 04:20:27","vote_count":108,"fav_count":0,"voted":false,"faved":false}}